# Создайте 2 переменных, содержащие числовые значения. Сравните их при помощи всех операторов сравнения и выведите результат на экран
number_1 = 2.36
number_2 = 6
print(number_1 == number_2)
print(number_1 != number_2)
print(number_1 > number_2)
print(number_1 < number_2)
print(number_1 >= number_2)
print(number_1 <= number_2)

# Сравните две одинаковых буквы, но одна из них должна быть заглавной, при помощи операторов сравнения ">" и выведите результат на экран. 
# Выведите на экран ASCII код каждой из букв
print('l' > 'L')
print(ord('l'))
print(ord('L'))
