# Создайте множество при помощи функции set() из текста, чтобы получить уникальные символы, содержащиеся в тексте. 
# Присвойте результат переменной. Выведите переменную на экран. Выведите тип значения переменной на экран. 
# При необходимости найдите информацию в интернете
random_text = set('To they four in love.'
               'Settling you has separate supplied bed.'
               'Concluded resembled suspected his resources curiosity joy.'
               'Led all cottage met enabled attempt through talking delight.'
               'Dare he feet my tell busy.'
               'Considered imprudence of he friendship boisterous.', )
print(random_text)
print(type(random_text))
