# Создайте новую строку 'Path' из строки 'Hello Python!' путём конкатенации частей строки и отсутствующего символа. Выведите новую строку на печать
txt = 'Hello Python!'
new_txt = txt[6] + 'a' + txt[-5:-3]
print(new_txt)

# Создайте строку 'zzzzzzz' при помощи умножения и выведите её на экран
txt = 'z' * 7
print(txt)

# Сделайте все буквы строки из предыдущего вопроса заглавными и выведите её на экран
txt = 'z' * 7
print(txt.upper())
